[
      {
        "collegeName": "ABC University",
        "collegeImage": "https://i.ibb.co/9vv7qVB/college1.jpg",
        "collegeRating": 4.8,
        "numberOfResearch": 1500,
        "admissionDate": "2023-08-15",
        "events": "Orientation Program, Annual Cultural Fest, Career Fair",
        "eventsDetails": "ABC University organizes various events throughout the year. The Orientation Program will be held on September 1st, 2023, at the main auditorium. The Annual Cultural Fest is scheduled from October 10th to October 12th, 2023, offering a celebration of diverse cultures. The Career Fair is set for November 5th, 2023, providing opportunities for students to explore career options.",
        "researchHistory": "Founded in 1960, ABC University has a rich history of research contributions.",
        "researchWorks": "The university's research focuses on a wide range of areas, including AI, renewable energy, and biotechnology. Recent research works have made significant advancements in these fields.",
        "sports": "Football, Cricket, Basketball, Badminton",
        "admissionProcess": "Applicants must apply online and pass an entrance examination.",
        "sportsCategories": "Indoor Sports, Outdoor Sports",
        "collegeDetails": "ABC University is a leading educational institution in Bangladesh, offering a wide range of academic programs."
      },
      {
        "collegeName": "XYZ College",
        "collegeImage": "https://i.ibb.co/VC1PrMY/college2.jpg",
        "collegeRating": 4.5,
        "numberOfResearch": 1200,
        "admissionDate": "2023-09-01",
        "events": "Freshers' Welcome Party, Tech Expo, Science Symposium",
        "eventsDetails": "XYZ College hosts several exciting events. The Freshers' Welcome Party is scheduled for September 15th, 2023, at the college amphitheater, providing an opportunity for newcomers to socialize. The Tech Expo on October 20th, 2023, showcases innovative projects by students. The Science Symposium, set for November 10th, 2023, features renowned scientists presenting cutting-edge research findings.",
        "researchHistory": "Founded in 1985, XYZ College has a strong research background.",
        "researchWorks": "The college's research efforts focus on environmental sustainability, nanotechnology, and healthcare. Recent research works have made notable contributions in these domains.",
        "sports": "Volleyball, Table Tennis, Chess, Swimming",
        "admissionProcess": "Prospective students must submit an application form and attend an interview.",
        "sportsCategories": "Team Sports, Individual Sports",
        "collegeDetails": "XYZ College is committed to providing quality education and fostering a supportive learning environment."
      },
      {
        "collegeName": "PQR Institute",
        "collegeImage": "https://i.ibb.co/GvQHFrm/college3.jpg",
        "collegeRating": 4.6,
        "numberOfResearch": 900,
        "admissionDate": "2023-07-31",
        "events": "Annual Sports Meet, Literary Festival, Entrepreneurship Summit",
        "eventsDetails": "PQR Institute hosts diverse events for its students. The Annual Sports Meet, held from August 20th to August 25th, 2023, at the college sports ground, is a celebration of athleticism and team spirit. The Literary Festival on September 5th, 2023, features renowned authors and poets sharing their works. The Entrepreneurship Summit on October 15th, 2023, promotes innovation and startups through insightful sessions.",
        "researchHistory": "Established in 1999, PQR Institute has a legacy of impactful research.",
        "researchWorks": "The institute's research focuses on cutting-edge technologies, including robotics, artificial intelligence, and sustainable development. Recent research works have garnered attention for their potential societal impact.",
        "sports": "Basketball, Cricket, Athletics, Tennis",
        "admissionProcess": "The admission process includes a written test and a personal interview.",
        "sportsCategories": "Outdoor Sports, Indoor Sports",
        "collegeDetails": "PQR Institute strives to nurture critical thinking and provide practical exposure to its students."
      },
      {
        "collegeName": "EFG Medical College",
        "collegeImage": "https://i.ibb.co/Dbm4HLn/college4.jpg",
        "collegeRating": 4.9,
        "numberOfResearch": 1800,
        "admissionDate": "2023-09-10",
        "events": "White Coat Ceremony, Health Symposium, Career Expo",
        "eventsDetails": "EFG Medical College holds significant events. The White Coat Ceremony is scheduled on September 25th, 2023, to welcome new medical students. The Health Symposium, on October 15th, 2023, features experts discussing medical advancements. The Career Expo, set for November 8th, 2023, allows students to explore career options in the healthcare field.",
        "researchHistory": "EFG Medical College is renowned for its pioneering research in medical sciences.",
        "researchWorks": "The college's research encompasses various medical disciplines, including genetics, immunology, and public health. Recent research works have contributed to advancements in healthcare and disease management.",
        "sports": "Table Tennis, Badminton, Athletics, Yoga",
        "admissionProcess": "Prospective medical students must undergo a rigorous admission process, including an entrance exam and interview.",
        "sportsCategories": "Indoor Sports, Wellness Activities",
        "collegeDetails": "EFG Medical College is a premier institution training future healthcare professionals and promoting medical research."
      },
      {
        "collegeName": "LMN Engineering University",
        "collegeImage": "https://i.ibb.co/gJcxw7T/college5.jpg",
        "collegeRating": 4.7,
        "numberOfResearch": 1350,
        "admissionDate": "2023-08-25",
        "events": "Tech Fest, Engineering Expo, Alumni Meet",
        "eventsDetails": "LMN Engineering University hosts exciting technical events. The Tech Fest is scheduled from September 5th to September 7th, 2023, showcasing innovative projects. The Engineering Expo on October 25th, 2023, highlights the achievements of engineering students. The Alumni Meet on November 15th, 2023, reunites former students and promotes networking.",
        "researchHistory": "LMN Engineering University has a strong legacy of research in various engineering disciplines.",
        "researchWorks": "The university's research encompasses diverse fields, including mechanical engineering, computer science, and civil engineering. Recent research works have contributed to technological advancements and infrastructure development.",
        "sports": "Cricket, Football, Tennis, Chess",
        "admissionProcess": "Prospective engineering students must pass an entrance exam and undergo a competitive selection process.",
        "sportsCategories": "Outdoor Sports, Indoor Sports",
        "collegeDetails": "LMN Engineering University is a prestigious institution fostering innovation and excellence in engineering education."
      }
]
    